app/views/movies/index.html.erb

SELECT "movies".* FROM "movies" WHERE (released_on <= '2016-03-14 12:03:22.384354')  ORDER BY released_on desc
SELECT COUNT(*) FROM "movies" WHERE (released_on <= '2016-03-14 12:03:22.384354')
---
  <%= render 'header' %>
  <h1><%= pluralize(@movies.size, 'Movie') %></h1>