app/views/movies/show.html.erb

  <%= link_to("All Movies", root_path) %>
  <%= link_to pluralize(@movie.reviews.size, "review"),
            movie_reviews_path(@movie) %>
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 13]]