app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE (released_on <= '2016-03-14 11:27:13.488917')  ORDER BY released_on desc

  def update
    @movie = Movie.find(params[:id])
    movie_params = params.require(:movie).permit!
      if @movie.update(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "cast" = ?, "director" = ?, "duration" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["cast", ""], ["director", ""], ["duration", ""], ["image_file_name", "Tears.jpg"], ["updated_at", "2016-03-14 12:47:46.451064"], ["id", 8]]

  def create
    movie_params = params.require(:movie).permit!
    @movie = Movie.new(movie_params)
      if @movie.save
---
INSERT INTO "movies" ("name", "description", "price", "released_on", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "sdsf"], ["description", "sfgsdf"], ["price", 2323.0], ["released_on", "2016-03-14"], ["created_at", "2016-03-14 08:37:32.594905"], ["updated_at", "2016-03-14 08:37:32.594905"]]