app/controllers/reviews_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 5]]
---
    def index
      @movie = Movie.find(params[:movie_id])

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
    def new
      @movie = Movie.find(params[:movie_id])

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "reviews" ("name", "comment", "stars", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Lee"], ["comment", "Power Packed Performance...!!"], ["stars", 4], ["movie_id", 2], ["created_at", "2016-03-15 11:31:43.399146"], ["updated_at", "2016-03-15 11:31:43.399146"]]
---
    def create
      @movie = Movie.find(params[:movie_id])
      @review = @movie.reviews.new(review_params)
      if @review.save